app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @school_classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "History of Western Europe"], ["created_at", "2018-07-05 20:57:07.100172"], ["updated_at", "2018-07-05 20:57:07.100172"]]
---
  def create
    @school_class = SchoolClass.create(post_params(:title, :description))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @school_class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @school_class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Linear Algebra"], ["room_number", 200], ["updated_at", "2018-07-05 20:59:59.526887"], ["id", 2]]
---
  def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(post_params(:title, :room_number))