app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @students = Student.all

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Harlem"], ["last_name", "Shake"], ["created_at", "2018-07-05 20:54:35.572840"], ["updated_at", "2018-07-05 20:54:35.572840"]]
---
  def create
    @student = Student.create(post_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Boruto"], ["last_name", "Uzumaki"], ["updated_at", "2018-07-05 21:00:37.791914"], ["id", 3]]
---
  def update
	  @student = Student.find(params[:id])
	  @student.update(post_params(:first_name, :last_name))